<template>
  <section>
    <i>Сервис регистрации документов позволяет проводить регистрацию документов лабораторного комплекса, а также ознакомление сотрудников с зарегистрированными документами. Данный сервис не позволяет регистрировать корреспонденцию и внутренние нормативные документы.</i>
    <br><span class="orange mouse-pointer" OnClick="$('#descriptionTable').toggle('show');">Как пользоваться сервисом?</span>
    <div class="sampleBox" id="descriptionTable" style="display:none;">
      <h4>1	РЕГИСТРАЦИЯ ДОКУМЕНТА</h4>
      <ul>Для регистрации документа необходимо:
        <li>В поле <strong>«Дата создания»</strong> указать дату подписания регистрируемого документа.</li>
        <li>В поле <strong>«Вид документа»</strong> выбрать вид регистрируемого документа (например: отчет, распоряжение).</li>
        <li>В поле <strong>«Локация»</strong> выбрать «Новокузнецк».</li>
        <li>В поле <strong>«DivCode»</strong> выбрать «020-2010-2002 Min Laboratory RU».</li>
        <li>В поле <strong>«Краткое содержание документа»</strong> указать заголовок регистрируемого документа (например: о назначении комиссии по ТБ).</li>
        <li>В поле <strong>«Примечание»</strong>, при необходимости, указывается любая вспомогательная информация.</li>
        <li>После заполнения полей необходимо нажать кнопку <span class="orange">«Сохранить»</span>, произойдет <strong>регистрация</strong> документа.</li>
        <li>Если все операции выполнены правильно в поле <strong>«Номер документа»</strong> отобразиться номер зарегистрированного документа в формате: <strong>NKYY/RegNxxxx</strong>,<br>
            где хххх- числовое значение регистрации,а YY 2 последние цифры текущего года</li>
        <li>Далее, в поле <strong>«Подписант»</strong> необходимо указать лицо, которое подписало данный зарегистрированный документ»</li>
      </ul>
      В бумажном экземпляре зарегистрированного документа номер будет указываться следующим образом: вид документа_номер документа_от_дата документа. <br>
      <strong>Например</strong>, <i>распоряжение начальника лаборатории №NK18/RegN0001 от 01.01.1990.</i>
      <h4>2	ЗАГРУЗКА ДОКУМЕНТА</h4>
      Если необходимо произвести ознакомление сотрудников с документом, то выполняется <strong>загрузка</strong> скан-копии документа и выбор списка ознакамливаемых лиц.<br>
      Для загрузки скан-копии документа необходимо нажать на кнопку <span class="orange">«Выберите файл»</span>, выбрать загружаемый файл и нажать на кнопку <span class="orange">«Загрузить»</span>. 
      Если загрузка файла выполнена успешно, в списке <span class="gray">«Загруженные файлы»</span> появится загруженный документ. 
      <h5>Требования к загружаемому документу:</h5>
        <li>Формат pdf</li> 
        <li>Размер не более 10 Мб</li>
      <h4>3	СОЗДАНИЕ СПИСКА ОЗНАКОМЛЕНИЯ С ДОКУМЕНТОМ</h4>
      Для создания списка ознакомления в поле <span class="gray">«Ознакомление с документом»</span> необходимо выбрать сотрудников, которые будут ознакомлены с документом. Сотрудников может быть несколько. Осуществить <strong>поиск</strong> сотрудников можно как на русском языке, так и на английском. Далее необходимо нажать на кнопку <span class="orange">«Сохранить»</span>.
      <h5>3.1	ОЗНАКОМЛЕНИЕ С ДОКУМЕНТОМ</h5>
      Если сотрудник был добавлен в список лиц, которым необходимо ознакомиться с документом, то на его адрес электронной почты поступит электронное письмо с заголовком <strong>«LabDocuments – <i>tttttt</i>»</strong>, <br>
      где <i>tttttt</i> - вид документа в английской транскрипции.<br>
      Текст письма будет содержать следующую информацию:<br><br>
      <q>
      Вам необходимо ознакомиться со следующим зарегистрированным документом<br>
      <span class="orange">Регистрационный номер:</span> NKYY/RegNХХХХ<br>
      <span class="orange">Вид документа: </span><br>
      <span class="orange">Краткое содержание документа: </span><br>
      <span class="orange">Подписанты: </span><br>
      Ознакомление по ссылке.</q><br><br>
      Сотрудник должен перейти по указанной в письме <span class="gray">ссылке</span>, открыть скан-копию документа, ознакомиться с документом и в поле <span class="gray">«Ознакомление с документом»</span> найти свою фамилию, поставить отметку (галочку) об ознакомлении в поле  <span class="gray">«Отметка об ознакомлении»</span>.<br><br>
      <strong>Внимание</strong>, поставив отметку об ознакомлении, удалить ее будет невозможно.
    </div>
  </section>
</template>

<script>
  export default {
    name: 'HowToUse'
  };
</script>